tutorials/viscoelasticFluidFoam/FENE-P/system/sampleDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "FENE-P";
    instance        "";
    local           "";

    class           dictionary;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


interpolationScheme cellPoint;

writeFormat     raw;

sets
(

// x axes N1 upstream profile
    fig7_x_037
    {
        type            uniform;
        axis            distance;
        start           (0.25482  0.0    0.00016);
        end             (0.25482  0.0128 0.00016);
        nPoints         100;
    }

    fig7_x_05
    {
        type            uniform;
        axis            distance;
        start           (0.2544  0.0    0.00016);
        end             (0.2544  0.0128 0.00016);
        nPoints         100;
    }


    fig7_x_1
    {
        type            uniform;
        axis            distance;
        start           (0.2528  0.0    0.00016);
        end             (0.2528  0.0128 0.00016);
        nPoints         100;
    }


    fig7_x_15
    {
        type            uniform;
        axis            distance;
        start           (0.2512  0.0    0.00016);
        end             (0.2512  0.0128 0.00016);
        nPoints         100;
    }

    fig7_x_2
    {
        type            uniform;
        axis            distance;
        start           (0.2496  0.0    0.00016);
        end             (0.2496  0.0128 0.00016);
        nPoints         100;
    }

    fig7_x_10
    {
        type            uniform;
        axis            distance;
        start           (0.2240  0.0    0.00016);
        end             (0.2240  0.0128 0.00016);
        nPoints         100;
    }


// y axes N1 upstream profile

    fig7_y_1
    {
        type            uniform;
        axis            distance;
        start           (0.2432     0.0032  0.00016);
        end             (0.2544  0.0032  0.00016);
        nPoints         100;
    }

    fig7_y_15
    {
        type            uniform;
        axis            distance;
        start           (0.2432    0.0048  0.00016);
        end             (0.2544  0.0048  0.00016);
        nPoints         100;
    }

    fig7_y_2
    {
        type            uniform;
        axis            distance;
        start           (0.2432    0.0064  0.00016);
        end             (0.2544  0.0064  0.00016);
        nPoints         100;
    }

    fig7_y_25
    {
        type            uniform;
        axis            distance;
        start           (0.2432    0.0080  0.00016);
        end             (0.2544  0.0080  0.00016);
        nPoints         100;
    }

    fig7_y_3
    {
        type            uniform;
        axis            distance;
        start           (0.2432    0.0096  0.00016);
        end             (0.2544  0.0096  0.00016);
        nPoints         100;
    }

    fig7_y_35
    {
        type            uniform;
        axis            distance;
        start           (0.2432    0.0112  0.00016);
        end             (0.2544  0.0112  0.00016);
        nPoints         100;
    }

// x axes N1 downstream profile

    ufig10_x_5
    {
        type            uniform;
        axis            distance;
        start           (0.2720  0.0    0.00016);
        end             (0.2720  0.00256 0.00016);
        nPoints         100;
    }

    fig10_x_1
    {
        type            uniform;
        axis            distance;
        start           (0.2592  0.0    0.00016);
        end             (0.2592  0.00256 0.00016);
        nPoints         100;
    }

    fig10_x_05
    {
        type            uniform;
        axis            distance;
        start           (0.2576  0.0    0.00016);
        end             (0.2576  0.00256 0.00016);
        nPoints         100;
    }

    fig10_x_0
    {
        type            uniform;
        axis            distance;
        start           (0.2560  0.0    0.00016);
        end             (0.2560  0.00256 0.00016);
        nPoints         100;
    }

// y axes N1 downstream profile

    fig11_y_1
    {
        type            uniform;
        axis            distance;
        start           (0.2176     0.0032  0.00016);
        end             (0.2544     0.0032  0.00016);
        nPoints         100;
    }

    fig11_y_04
    {
        type            uniform;
        axis            distance;
        start           (0.2176     0.00128  0.00016);
        end             (0.2752     0.00128  0.00016);
        nPoints         100;
    }

    fig11_y_0
    {
        type            uniform;
        axis            distance;
        start           (0.2176     0.0  0.00016);
        end             (0.2752     0.0  0.00016);
        nPoints         100;
    }

);

surfaces
();

fields
(
    N1
);


// ************************************************************************* //
